In [20]:
import pandas as pd

In [21]:
df = pd.read_csv('Gin_csv.csv', sep='\t', header=None, names=['Name', 'Price'])

In [22]:
df.Name.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
Name: Name, dtype: bool

In [25]:
df.loc[df.Name.duplicated()]

                    Name   Price
11  London Tower Dry GIN  $38.99